3B/ECE358/src/05-Application-Layer.org
#+title: Application Layer
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Principles of Network Applications
Network applications are programs that run on (different) end systems and communicate over the network.

There is no need to write software for network-core devices since they do not run user applications.
Also, applications on end systems allow for rapid app development and propagation.

In client server paradigm:
- _server_ is an always-on host with a permanent IP address, often in data centers for scaling
- _clients_ (HTTP, IMAP, FTP)
  - contact and communicate with the server
  - may be intermittently connected and have dynamic IP addresses
  - do not communicate directly with each other

In peer-peer architecture (like P2P file sharing):
- no always on server so end systems directly communicate
- peers request service from and provide service to other peers
  - *self scalability*: new peers bring new service capacity as well as new service demands
- peers are intermittently connected and change IP addresses (so management is complex)

*Process*: program running with a host

With the same host, two processes communicate using inter-process (defined by OS).
In different hosts, processes communicate by exchanging messages.

*Client process*: process that initiates communication

*Server process*: process that waits to be contacted

Both are present in P2P architectures.

Application-layer protocol defines:
- _types of message exchanged_
- _message syntax_: what fields in messages and how fields are delineated
- _message semantics_: meaning of info in fields
- _rules_ for when and how processes send and respond to messages

Protocols can be:
- _open protocols_: defined in RFCs, everyone has access to protocol definition, allows for interoperability
- _proprietary protocols_

To choose a transport service, consider:
- *data integrity*: can loss be tolerated or is reliability required
- *timing*: some apps require low delay to be effectve
- *throughput*: does the app require some minimum amount of throughput to be effective
- *security*: encryption and data integrity

* Socket Programming
*Socket*: door between application process and end-to-end transport protocol

Sockets can be UDP (unreliable datagram) or TCP (reliable, byte stream-oriented).

** UDP
No connection between client and server (no handshake).

Sender explicitly attaches IP destination address and port number to each packet.
Receiver extracts sender IP address and port number from received packet.

Transmitted data may be lost or received out-of-order.

** TCP
Client must contact running server, which must have created socket to welcome client's contact.

Client contacts server by creating TCP socket with IP address and port number specified.

When contacted by client, server TCP creates new socket for server process to communicate with
that particular client:
- allows server to talk with multiple clients
- source port numbers used to distinguish clients

