3B/ECE358/05-Application-Layer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-02 Mon 15:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Application Layer</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Application Layer</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7166afe">1. Principles of Network Applications</a></li>
<li><a href="#org1a46a7d">2. Socket Programming</a>
<ul>
<li><a href="#orgac839b9">2.1. UDP</a></li>
<li><a href="#org84eeda6">2.2. TCP</a></li>
</ul>
</li>
<li><a href="#org2743665">3. Web and HTTP</a>
<ul>
<li><a href="#orgc41d901">3.1. QUIC: Quick UDP Internet Connections</a></li>
</ul>
</li>
<li><a href="#orgbc605e8">4. Email, SMTP, IMAP</a>
<ul>
<li><a href="#org015ce68">4.1. SMTP</a></li>
</ul>
</li>
<li><a href="#org0f27cad">5. Domain Name System (DNS)</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7166afe" class="outline-2">
<h2 id="org7166afe"><span class="section-number-2">1.</span> Principles of Network Applications</h2>
<div class="outline-text-2" id="text-1">
<p>
Network applications are programs that run on (different) end systems and communicate over the network.
</p>

<p>
There is no need to write software for network-core devices since they do not run user applications.
Also, applications on end systems allow for rapid app development and propagation.
</p>

<p>
In client server paradigm:
</p>
<ul class="org-ul">
<li><span class="underline">server</span> is an always-on host with a permanent IP address, often in data centers for scaling</li>
<li><span class="underline">clients</span> (HTTP, IMAP, FTP)
<ul class="org-ul">
<li>contact and communicate with the server</li>
<li>may be intermittently connected and have dynamic IP addresses</li>
<li>do not communicate directly with each other</li>
</ul></li>
</ul>

<p>
In peer-peer architecture (like P2P file sharing):
</p>
<ul class="org-ul">
<li>no always on server so end systems directly communicate</li>
<li>peers request service from and provide service to other peers
<ul class="org-ul">
<li><b>self scalability</b>: new peers bring new service capacity as well as new service demands</li>
</ul></li>
<li>peers are intermittently connected and change IP addresses (so management is complex)</li>
</ul>

<p>
<b>Process</b>: program running with a host
</p>

<p>
With the same host, two processes communicate using inter-process (defined by OS).
In different hosts, processes communicate by exchanging messages.
</p>

<p>
<b>Client process</b>: process that initiates communication
</p>

<p>
<b>Server process</b>: process that waits to be contacted
</p>

<p>
Both are present in P2P architectures.
</p>

<p>
Application-layer protocol defines:
</p>
<ul class="org-ul">
<li><span class="underline">types of message exchanged</span></li>
<li><span class="underline">message syntax</span>: what fields in messages and how fields are delineated</li>
<li><span class="underline">message semantics</span>: meaning of info in fields</li>
<li><span class="underline">rules</span> for when and how processes send and respond to messages</li>
</ul>

<p>
Protocols can be:
</p>
<ul class="org-ul">
<li><span class="underline">open protocols</span>: defined in RFCs, everyone has access to protocol definition, allows for interoperability</li>
<li><span class="underline">proprietary protocols</span></li>
</ul>

<p>
To choose a transport service, consider:
</p>
<ul class="org-ul">
<li><b>data integrity</b>: can loss be tolerated or is reliability required</li>
<li><b>timing</b>: some apps require low delay to be effectve</li>
<li><b>throughput</b>: does the app require some minimum amount of throughput to be effective</li>
<li><b>security</b>: encryption and data integrity</li>
</ul>
</div>
</div>
<div id="outline-container-org1a46a7d" class="outline-2">
<h2 id="org1a46a7d"><span class="section-number-2">2.</span> Socket Programming</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Socket</b>: door between application process and end-to-end transport protocol
</p>

<p>
Sockets can be UDP (unreliable datagram) or TCP (reliable, byte stream-oriented).
</p>
</div>
<div id="outline-container-orgac839b9" class="outline-3">
<h3 id="orgac839b9"><span class="section-number-3">2.1.</span> UDP</h3>
<div class="outline-text-3" id="text-2-1">
<p>
No connection between client and server (no handshake).
</p>

<p>
Sender explicitly attaches IP destination address and port number to each packet.
Receiver extracts sender IP address and port number from received packet.
</p>

<p>
Transmitted data may be lost or received out-of-order.
</p>
</div>
</div>
<div id="outline-container-org84eeda6" class="outline-3">
<h3 id="org84eeda6"><span class="section-number-3">2.2.</span> TCP</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Client must contact running server, which must have created socket to welcome client&rsquo;s contact.
</p>

<p>
Client contacts server by creating TCP socket with IP address and port number specified.
</p>

<p>
When contacted by client, server TCP creates new socket for server process to communicate with
that particular client:
</p>
<ul class="org-ul">
<li>allows server to talk with multiple clients</li>
<li>source port numbers used to distinguish clients</li>
</ul>
</div>
</div>
</div>
