3B/ECE358/05-Application-Layer.tex
% Created 2024-12-02 Mon 15:55
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Application Layer}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Application Layer},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Principles of Network Applications}
\label{sec:orgca531dd}
Network applications are programs that run on (different) end systems and communicate over the network.

There is no need to write software for network-core devices since they do not run user applications.
Also, applications on end systems allow for rapid app development and propagation.

In client server paradigm:
\begin{itemize}
\item \uline{server} is an always-on host with a permanent IP address, often in data centers for scaling
\item \uline{clients} (HTTP, IMAP, FTP)
\begin{itemize}
\item contact and communicate with the server
\item may be intermittently connected and have dynamic IP addresses
\item do not communicate directly with each other
\end{itemize}
\end{itemize}

In peer-peer architecture (like P2P file sharing):
\begin{itemize}
\item no always on server so end systems directly communicate
\item peers request service from and provide service to other peers
\begin{itemize}
\item \textbf{self scalability}: new peers bring new service capacity as well as new service demands
\end{itemize}
\item peers are intermittently connected and change IP addresses (so management is complex)
\end{itemize}

\textbf{Process}: program running with a host

With the same host, two processes communicate using inter-process (defined by OS).
In different hosts, processes communicate by exchanging messages.

\textbf{Client process}: process that initiates communication

\textbf{Server process}: process that waits to be contacted

Both are present in P2P architectures.

Application-layer protocol defines:
\begin{itemize}
\item \uline{types of message exchanged}
\item \uline{message syntax}: what fields in messages and how fields are delineated
\item \uline{message semantics}: meaning of info in fields
\item \uline{rules} for when and how processes send and respond to messages
\end{itemize}

Protocols can be:
\begin{itemize}
\item \uline{open protocols}: defined in RFCs, everyone has access to protocol definition, allows for interoperability
\item \uline{proprietary protocols}
\end{itemize}

To choose a transport service, consider:
\begin{itemize}
\item \textbf{data integrity}: can loss be tolerated or is reliability required
\item \textbf{timing}: some apps require low delay to be effectve
\item \textbf{throughput}: does the app require some minimum amount of throughput to be effective
\item \textbf{security}: encryption and data integrity
\end{itemize}
\section{Socket Programming}
\label{sec:orgb1cd792}
\textbf{Socket}: door between application process and end-to-end transport protocol

Sockets can be UDP (unreliable datagram) or TCP (reliable, byte stream-oriented).
\subsection{UDP}
\label{sec:org45c688d}
No connection between client and server (no handshake).

Sender explicitly attaches IP destination address and port number to each packet.
Receiver extracts sender IP address and port number from received packet.

Transmitted data may be lost or received out-of-order.
\subsection{TCP}
\label{sec:org6489d05}
Client must contact running server, which must have created socket to welcome client's contact.

Client contacts server by creating TCP socket with IP address and port number specified.

When contacted by client, server TCP creates new socket for server process to communicate with
that particular client:
\begin{itemize}
\item allows server to talk with multiple clients
\item source port numbers used to distinguish clients
\end{itemize}
