3B/ECE358/src/05-Application-Layer.org
* Web and HTTP
Web page consists of objects which can be stored on different web servers,
like base HTML file which includes referenced objects, each addressable by a URL.

*HTTP: HyperText Transfer Protocol* is the web's application layer protocol:
- _client_: browser that requests and receives web objects
- _server_: web server sends objects in response to requests

HTTP uses TCP:
- client initiates TCP connection to server at port 80
- server accepts TCP connection from client
- HTTP messages exchanged between client and server
- TCP connection closed

Server maintains no information about past client requests.
(protocols that maintain stat are complex)

*Non-persistent HTTP*:
1. TCP connection opened
2. at most 1 object sent over TCP connection
3. TCP connection closed

For non-persistent HTTP,
$$ \text{Response Time} = 2 \text{RTT} + \text{File transmission time} $$
This requires 2 RTTs per object and OS overhead for each TCP connection.
Browsers often open multiple parallel TCP connections to fetch referenced objects in parallel.

*Persistent HTTP*:
1. TCP connection opened to a server
2. multiple objects can be sent over a single TCP connection between client and that server
3. TCP connection closed

For persistent HTTP, as little as 1 RTT for all referenced objects (cutting response time in half).

HTTP request message is ASCII (human readable format), with request line (GET, POST, HEAD, etc),
header lines, carriage return and line feed at start of line to indicate end of header lines, and
body.

HTTP request messages can be POST (often form input), GET (query for user data),
HEAD (headers only returned), and PUT (upload new file or replace existing file).

HTTP response message is also ASCII with status line (protocol, status code, status phrase),
header lines, and data (after ~\r\n~).

HTTP response status codes include 200 OK, 301 Moved Permanently, 400 Bad Request, 404 Not Found, and
505 HTTP Version Not Supported.

** QUIC: Quick UDP Internet Connections
Application-layer protocol on top of UDP that increases the performance of HTTP.

Adopts TCP approaches for connection establishment, error control, and congestion control.

Uses multiple application-level streams multiplexed over single QUIC connection, so separate
reliable data transfer and security, as well as common congestion control.

QUIC does a single handshake for TCP and TLS (security/auth) together in one.

With parallelism from QUIC stream, there is no head-of-line blocking (no need to wait for earlier
requests to go through since parallel).

* Email, SMTP, IMAP
Major components are user agents, mail servers, and Single Mail Transfer Protocol (SMTP).

*User agent* is mail reader, for composing, editing, and reading mail messages.

*Mail server* has mailbox with incoming messages for user and message queue of outgoing mail
messages.

*SMTP* used between mail servers to send email messages.

** SMTP
Use TCP to reliably transfer email message from client (mail server) to server with port 25.

3 phases of transfer:
- SMTP handshaking
- SMTP transfer of messages
- SMTP closure

Command/response interaction with ASCII text commands and status code/phrase response.

As opposed to HTTP, which is client pull SMTP is client push.
In HTTP, each object is encapsulated in its own response message.
In SMTP, multiple objects are sent in multipart message.

SMTP uses persistent connections, requires message to be in 7-bit ASCII, and uses
CRLF.CRLF to determine end of message.

SMTP email message contains header lines (to, from, subject) and body (message).

Internet Mail Access Protocol (IMAP) provides retrieval, deletion, and folders of stored messages
on mail server (retrieval from mail server to user agent).

