3B/ECE358/05-Application-Layer.html
<div id="outline-container-org2743665" class="outline-2">
<h2 id="org2743665"><span class="section-number-2">3.</span> Web and HTTP</h2>
<div class="outline-text-2" id="text-3">
<p>
Web page consists of objects which can be stored on different web servers,
like base HTML file which includes referenced objects, each addressable by a URL.
</p>

<p>
<b>HTTP: HyperText Transfer Protocol</b> is the web&rsquo;s application layer protocol:
</p>
<ul class="org-ul">
<li><span class="underline">client</span>: browser that requests and receives web objects</li>
<li><span class="underline">server</span>: web server sends objects in response to requests</li>
</ul>

<p>
HTTP uses TCP:
</p>
<ul class="org-ul">
<li>client initiates TCP connection to server at port 80</li>
<li>server accepts TCP connection from client</li>
<li>HTTP messages exchanged between client and server</li>
<li>TCP connection closed</li>
</ul>

<p>
Server maintains no information about past client requests.
(protocols that maintain stat are complex)
</p>

<p>
<b>Non-persistent HTTP</b>:
</p>
<ol class="org-ol">
<li>TCP connection opened</li>
<li>at most 1 object sent over TCP connection</li>
<li>TCP connection closed</li>
</ol>

<p>
For non-persistent HTTP,
\[ \text{Response Time} = 2 \text{RTT} + \text{File transmission time} \]
This requires 2 RTTs per object and OS overhead for each TCP connection.
Browsers often open multiple parallel TCP connections to fetch referenced objects in parallel.
</p>

<p>
<b>Persistent HTTP</b>:
</p>
<ol class="org-ol">
<li>TCP connection opened to a server</li>
<li>multiple objects can be sent over a single TCP connection between client and that server</li>
<li>TCP connection closed</li>
</ol>

<p>
For persistent HTTP, as little as 1 RTT for all referenced objects (cutting response time in half).
</p>

<p>
HTTP request message is ASCII (human readable format), with request line (GET, POST, HEAD, etc),
header lines, carriage return and line feed at start of line to indicate end of header lines, and
body.
</p>

<p>
HTTP request messages can be POST (often form input), GET (query for user data),
HEAD (headers only returned), and PUT (upload new file or replace existing file).
</p>

<p>
HTTP response message is also ASCII with status line (protocol, status code, status phrase),
header lines, and data (after <code>\r\n</code>).
</p>

<p>
HTTP response status codes include 200 OK, 301 Moved Permanently, 400 Bad Request, 404 Not Found, and
505 HTTP Version Not Supported.
</p>
</div>
<div id="outline-container-orgc41d901" class="outline-3">
<h3 id="orgc41d901"><span class="section-number-3">3.1.</span> QUIC: Quick UDP Internet Connections</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Application-layer protocol on top of UDP that increases the performance of HTTP.
</p>

<p>
Adopts TCP approaches for connection establishment, error control, and congestion control.
</p>

<p>
Uses multiple application-level streams multiplexed over single QUIC connection, so separate
reliable data transfer and security, as well as common congestion control.
</p>

<p>
QUIC does a single handshake for TCP and TLS (security/auth) together in one.
</p>

<p>
With parallelism from QUIC stream, there is no head-of-line blocking (no need to wait for earlier
requests to go through since parallel).
</p>
</div>
</div>
</div>
<div id="outline-container-orgbc605e8" class="outline-2">
<h2 id="orgbc605e8"><span class="section-number-2">4.</span> Email, SMTP, IMAP</h2>
<div class="outline-text-2" id="text-4">
<p>
Major components are user agents, mail servers, and Single Mail Transfer Protocol (SMTP).
</p>

<p>
<b>User agent</b> is mail reader, for composing, editing, and reading mail messages.
</p>

<p>
<b>Mail server</b> has mailbox with incoming messages for user and message queue of outgoing mail
messages.
</p>

<p>
<b>SMTP</b> used between mail servers to send email messages.
</p>
</div>
<div id="outline-container-org015ce68" class="outline-3">
<h3 id="org015ce68"><span class="section-number-3">4.1.</span> SMTP</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Use TCP to reliably transfer email message from client (mail server) to server with port 25.
</p>

<p>
3 phases of transfer:
</p>
<ul class="org-ul">
<li>SMTP handshaking</li>
<li>SMTP transfer of messages</li>
<li>SMTP closure</li>
</ul>

<p>
Command/response interaction with ASCII text commands and status code/phrase response.
</p>

<p>
As opposed to HTTP, which is client pull SMTP is client push.
In HTTP, each object is encapsulated in its own response message.
In SMTP, multiple objects are sent in multipart message.
</p>

<p>
SMTP uses persistent connections, requires message to be in 7-bit ASCII, and uses
CRLF.CRLF to determine end of message.
</p>

<p>
SMTP email message contains header lines (to, from, subject) and body (message).
</p>

<p>
Internet Mail Access Protocol (IMAP) provides retrieval, deletion, and folders of stored messages
on mail server (retrieval from mail server to user agent).
</p>
</div>
</div>
</div>
