3B/ECE358/src/05-Application-Layer.org
* Domain Name System (DNS)
Distributed database implemented in hierarchy of many name servers.
An application-layer protocol where hosts and DNS servers communicate to resolve names (translate
from name to address). This is a core Internet function implemented as an application-layer protocol.

Hostname-to-IP address translation to assist with host aliasing (canonical alias names) and mail server
aliasing.
Also helps with load distribution through replicated web servers (many IP addresses correspond to
one name).

Centralizing DNS would cause single point of failure, too high traffic volume, distant centralized DB,
and difficult maintenance. Overall, wouldn't scale.

For DNS, billions of simple records and trillions of queries daily with many more reads than writes.
Must be reliable and secure always, while being organizationally and physically decentralized.

Hierarchy:
- root server for top level domain DNS server
  - official, contact of last resort by name servers that cannot resolve name
  - managed by ICANN
  - DNSSEC \to provides security (auth and message integrity)
  - 13 globally
- top level domain DNS server for authoritative DNS servers
  - responsible for TLDs like .com, .org, etc
- authoritative DNS servers for IP address
  - organization's DNS server providing authoritative hostname to IP mappings for organization's named
    hosts
  - can be managed by organization or service provider

DNS query is sent to local DNS server, which returns reply answering from local cache or forwarding
request into DNS hierarchy.

Each ISP has local DNS server (does not strictly belong to hierarchy).

*Iterated query*: contacted server replies with name of server to contact

*Recursive query*: puts burden of name resolution on contacted name server, can cause heavy load at
upper levels of hierarchy

Once any name server learns mapping, this is cached and the cached mapping is returned.
Improves response time and cache entries timeout after some TTL.
TLD servers typically cached in local name servers.

Cached entries can be out of date, so DNS is best effort.

DNS records have format (~name~, ~value~, ~type~, ~ttl~) and can have different types:
- _type A_: ~name~ is hostname, ~value~ is IP address
- _type NS_: ~name~ is domain, ~value~ is hostname of authoritative name server for domain
- _type CNAME_: ~name~ is alias name, ~value~ is canonical name
- _type MX_: ~value~ is name of SMTP mail server associated with ~name~

DNS query and reply messages have the same format:
- _message header_: identification (16 bit number for query and reply) and flags (query or reply,
  recursion desired, recursion available, reply is authoritative)
- _numbers of questions, answer records, authority records, additional records_
- _questions_
- _answers_
- _authority_
- _additional info_

To get info into DNS, register name at DNS registrar by providing names and IP addresses of authoritative
name server (primary and secondary).
Then, create authoritative server locally with IP address.
