3B/ECE358/05-Application-Layer.html
<div id="outline-container-org0f27cad" class="outline-2">
<h2 id="org0f27cad"><span class="section-number-2">5.</span> Domain Name System (DNS)</h2>
<div class="outline-text-2" id="text-5">
<p>
Distributed database implemented in hierarchy of many name servers.
An application-layer protocol where hosts and DNS servers communicate to resolve names (translate
from name to address). This is a core Internet function implemented as an application-layer protocol.
</p>

<p>
Hostname-to-IP address translation to assist with host aliasing (canonical alias names) and mail server
aliasing.
Also helps with load distribution through replicated web servers (many IP addresses correspond to
one name).
</p>

<p>
Centralizing DNS would cause single point of failure, too high traffic volume, distant centralized DB,
and difficult maintenance. Overall, wouldn&rsquo;t scale.
</p>

<p>
For DNS, billions of simple records and trillions of queries daily with many more reads than writes.
Must be reliable and secure always, while being organizationally and physically decentralized.
</p>

<p>
Hierarchy:
</p>
<ul class="org-ul">
<li>root server for top level domain DNS server
<ul class="org-ul">
<li>official, contact of last resort by name servers that cannot resolve name</li>
<li>managed by ICANN</li>
<li>DNSSEC &rarr; provides security (auth and message integrity)</li>
<li>13 globally</li>
</ul></li>
<li>top level domain DNS server for authoritative DNS servers
<ul class="org-ul">
<li>responsible for TLDs like .com, .org, etc</li>
</ul></li>
<li>authoritative DNS servers for IP address
<ul class="org-ul">
<li>organization&rsquo;s DNS server providing authoritative hostname to IP mappings for organization&rsquo;s named
hosts</li>
<li>can be managed by organization or service provider</li>
</ul></li>
</ul>

<p>
DNS query is sent to local DNS server, which returns reply answering from local cache or forwarding
request into DNS hierarchy.
</p>

<p>
Each ISP has local DNS server (does not strictly belong to hierarchy).
</p>

<p>
<b>Iterated query</b>: contacted server replies with name of server to contact
</p>

<p>
<b>Recursive query</b>: puts burden of name resolution on contacted name server, can cause heavy load at
upper levels of hierarchy
</p>

<p>
Once any name server learns mapping, this is cached and the cached mapping is returned.
Improves response time and cache entries timeout after some TTL.
TLD servers typically cached in local name servers.
</p>

<p>
Cached entries can be out of date, so DNS is best effort.
</p>

<p>
DNS records have format (<code>name</code>, <code>value</code>, <code>type</code>, <code>ttl</code>) and can have different types:
</p>
<ul class="org-ul">
<li><span class="underline">type A</span>: <code>name</code> is hostname, <code>value</code> is IP address</li>
<li><span class="underline">type NS</span>: <code>name</code> is domain, <code>value</code> is hostname of authoritative name server for domain</li>
<li><span class="underline">type CNAME</span>: <code>name</code> is alias name, <code>value</code> is canonical name</li>
<li><span class="underline">type MX</span>: <code>value</code> is name of SMTP mail server associated with <code>name</code></li>
</ul>

<p>
DNS query and reply messages have the same format:
</p>
<ul class="org-ul">
<li><span class="underline">message header</span>: identification (16 bit number for query and reply) and flags (query or reply,
recursion desired, recursion available, reply is authoritative)</li>
<li><span class="underline">numbers of questions, answer records, authority records, additional records</span></li>
<li><span class="underline">questions</span></li>
<li><span class="underline">answers</span></li>
<li><span class="underline">authority</span></li>
<li><span class="underline">additional info</span></li>
</ul>

<p>
To get info into DNS, register name at DNS registrar by providing names and IP addresses of authoritative
name server (primary and secondary).
Then, create authoritative server locally with IP address.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-02 Mon 15:55</p>
</div>
</body>
</html>
