3B/ECE358/05-Application-Layer.tex
\section{Domain Name System (DNS)}
\label{sec:org1376803}
Distributed database implemented in hierarchy of many name servers.
An application-layer protocol where hosts and DNS servers communicate to resolve names (translate
from name to address). This is a core Internet function implemented as an application-layer protocol.

Hostname-to-IP address translation to assist with host aliasing (canonical alias names) and mail server
aliasing.
Also helps with load distribution through replicated web servers (many IP addresses correspond to
one name).

Centralizing DNS would cause single point of failure, too high traffic volume, distant centralized DB,
and difficult maintenance. Overall, wouldn't scale.

For DNS, billions of simple records and trillions of queries daily with many more reads than writes.
Must be reliable and secure always, while being organizationally and physically decentralized.

Hierarchy:
\begin{itemize}
\item root server for top level domain DNS server
\begin{itemize}
\item official, contact of last resort by name servers that cannot resolve name
\item managed by ICANN
\item DNSSEC \(\to\) provides security (auth and message integrity)
\item 13 globally
\end{itemize}
\item top level domain DNS server for authoritative DNS servers
\begin{itemize}
\item responsible for TLDs like .com, .org, etc
\end{itemize}
\item authoritative DNS servers for IP address
\begin{itemize}
\item organization's DNS server providing authoritative hostname to IP mappings for organization's named
hosts
\item can be managed by organization or service provider
\end{itemize}
\end{itemize}

DNS query is sent to local DNS server, which returns reply answering from local cache or forwarding
request into DNS hierarchy.

Each ISP has local DNS server (does not strictly belong to hierarchy).

\textbf{Iterated query}: contacted server replies with name of server to contact

\textbf{Recursive query}: puts burden of name resolution on contacted name server, can cause heavy load at
upper levels of hierarchy

Once any name server learns mapping, this is cached and the cached mapping is returned.
Improves response time and cache entries timeout after some TTL.
TLD servers typically cached in local name servers.

Cached entries can be out of date, so DNS is best effort.

DNS records have format (\texttt{name}, \texttt{value}, \texttt{type}, \texttt{ttl}) and can have different types:
\begin{itemize}
\item \uline{type A}: \texttt{name} is hostname, \texttt{value} is IP address
\item \uline{type NS}: \texttt{name} is domain, \texttt{value} is hostname of authoritative name server for domain
\item \uline{type CNAME}: \texttt{name} is alias name, \texttt{value} is canonical name
\item \uline{type MX}: \texttt{value} is name of SMTP mail server associated with \texttt{name}
\end{itemize}

DNS query and reply messages have the same format:
\begin{itemize}
\item \uline{message header}: identification (16 bit number for query and reply) and flags (query or reply,
recursion desired, recursion available, reply is authoritative)
\item \uline{numbers of questions, answer records, authority records, additional records}
\item \uline{questions}
\item \uline{answers}
\item \uline{authority}
\item \uline{additional info}
\end{itemize}

To get info into DNS, register name at DNS registrar by providing names and IP addresses of authoritative
name server (primary and secondary).
Then, create authoritative server locally with IP address.
\end{document}
